% ИНДИВИДУАЛЬНОЕ ЗАДАНИЕ 1 (в списке №8)
% Определить последний элемент списка.

% если в списке всего один элемент X, то он и является последним
my_last([X], X).

% ищем последний элемент X в хвосте T
my_last([_ | T], X) :- 
    my_last(T, X).

% ИНДИВИДУАЛЬНОЕ ЗАДАНИЕ 2 (в списке №3)
% Удалить все вхождения заданного элемента из списка.

% удаление любого элемента из пустого списка дает пустой список
remove_all(_, [],[]).

% если голова списка совпадает с удаляемым элементом X, её отбрасываем и продолжаем удаление только в хвосте T
remove_all(X, [X | T], Result) :-
    remove_all(X, T, Result).
    
% если голова списка H НЕ равна удаляемому элементу X (X \= H), переносим H в итоговый список и продолжаем удаление в хвосте T
remove_all(X, [H | T], [H | Result]) :-
    X \= H,
    remove_all(X, T, Result).
